module.exports.config = {
    name: "war",
    version: "1.0.0",
    hasPermssion: 2,
    credits: "𝐏𝐫𝐢𝐲𝐚𝐧𝐬𝐡 𝐑𝐚𝐣𝐩𝐮𝐭",
    description: "War in group boxchat",
    commandCategory: "group",
    usages: "bold war",
    cooldowns: 10,
    dependencies: {
        "fs-extra": "",
        "axios": ""
    }
}

module.exports.run = async function({ api, args, Users, event}) {
 var mention = Object.keys(event.mentions)[0];
    
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("Listen to your father, kids !");
setTimeout(() => {a({body: "এই খানকির পোলা তোর মায়রে চুদি তোর সাহস তো কম না তুই আমার বস চাঁদের চাঁদের পাহাড় এর সাথে লাগতে আসিস 🖕🥴" })}, 3000);
setTimeout(() => {a({body: " শালা মূর্খ পাবলিক তোদের সাহস দেখে আমি অবাক হয়ে যাই 🤬"})}, 5000);
setTimeout(() => {a({body: "এই খানকির পোলা উইড়া যা মাঙ্গের পোলা 👽" })}, 7000);
setTimeout(() => {a({body: " আমার বস চাঁদের পাহাড়ের দিকে যদি তাকাস 🥱 তাহলে তোর মার বিচি টেনে ছিড়বো 🤣 সেটা আবার কুত্তা দিয়ে খাওয়াবো 🥴🚮" })}, 9000);
setTimeout(() => {a({body: "নেক্সট টাইম যদি আবার লাগতে আসিস 🥵 তাহলে তোমার ভুদার মধ্যে পারমাণবিক বোম সেট করে দেবো 🪬🥴" })}, 12000);
setTimeout(() => {a({body: "আমার বস চাঁদের পাহাড় থেকে দূরে থাকবি শালা হিজড়া মাগির পোলা 👈" })}, 15000);
setTimeout(() => {a({body: "তোর মার দুধ আমার বস চাঁদের পার্কে খাওয়াইয়া দিব 🍼🥛" })}, 17000);
setTimeout(() => {a({body: " আমার বস চাঁদের পাহাড়ের সাথে লাগতে আসা মানে তোর মাকে তুই নিজেই চুদিস 🖕🤬" })}, 20000);
setTimeout(() => {a({body: " তোদের মত খানকির পোলারে আমার বস চুদা বাদ দিয়ে দিয়েছে 🖕🥱" })}, 23000);
setTimeout(() => {a({body: "বস চাঁদের পাহাড় বলেছে তোকে আর চুদবে না তোর বোন কে চুদবে 🥵🥵" })}, 25000);
setTimeout(() => {a({body: " তোর মত আবালচোদা কে চুদার টাইম নাই যা ভাগ 👉🚫 " })}, 28500);
setTimeout(() => {a({body: " বস চাঁদের পাহাড় তোকে চুদবে না তার পোষা কুত্তা দিয়ে চোদাবে 🥴🥴" })}, 31000);
setTimeout(() => {a({body: "শালা ২ টাকার বস্তি মাগির পোলা 🤬 চাঁদের পাহাড় কি তোর বাপ লাগে যে লাগতে আসিস 🤬  ?" })}, 36000);
setTimeout(() => {a({body: " চুদেচুদে তোর মার ভদা লাল করে দেব‌🤬🥵" })}, 39000);
setTimeout(() => {a({body: " আমার বস চাঁদের পাহাড় বলেছে সে তোর মাকে চুদে চুদে ক্লান্ত 🥵 তোর মাকে এখন আমাকে চুততে বলেছে তুই একটু সামনে থাক দেখ তোর সামনেই তোর মাকে আমি চুদব 🥵🥵" })}, 40000);
setTimeout(() => {a({body: " তোদের মত নটির পোলারে আমার বস চাঁদের পাহাড় এখন চোদে না🚫🥴" })}, 65000);
setTimeout(() => {a({body: " চাঁদের পাহাড়ের কুত্তা দিয়ে তোর মাকে চোদা খাওয়াবো আর তুই শুধু চেয়ে চেয়ে দেখবি 🥵🚫🥴"  })}, 70000);
setTimeout(() => {a({body: "বস চাঁদের পাহাড় বলেছে তোর মাকে শেয়ার চুদবে না 🥴 তোকেই তোর মাকে চ*** খাওয়াতে বলেছে 🥵🥵" })}, 75000);
setTimeout(() => {a({body: "The cunt is as big as a buffalo's cunt masturbating a sewer pipe" })}, 80000);
setTimeout(() => {a({body: " আমার বস চাঁদের পাহাড়ের সাথে যদি নেক্সটাইম লাগতে আসিস 🖕 তাহলে তোর মার বোদা টেনে ছিড়বো 🤬" })}, 85000);
setTimeout(() => {a({body: "তোর মার বোদা চাঙ্গে তুলে দেবো যদি আমার চাঁদের পাহাড়ের সাথে লাগতে আসিস 🤬")} , 90000);
setTimeout(() => {a({body: " আমার বস চাঁদের বাহার এখন ক্লান্ত হয়ে গেছে তোমাকে আর চোদা দিতে পারছে না 😌😌" })}, 95000);
setTimeout(() => {a({body: " হ্যাঁ কর আমার বস চাঁদের পাহাড় তোর মুখে মাল ফেলে দেবে এবার 🥵" })}, 100000);
setTimeout(() => {a({body: " এই নে আমার বস চাঁদের পাহাড় তোর মার ভোদায় মাল ঢেলে দিল 😌🥵" })}, 105000);
setTimeout(() => {a({body: "যা এখন ছেড়ে দিলাম কালকে আবার আসিস চুদা খেতে 🥵 আজকের বারে এটুকুই চোদা খাওয়ালাম 😌 কালকে তোর বোনকে আবার নিয়ে আসিস 🥵 একদম পেগনেট করে ছেড়ে দেবো যা 😩 আর একটা কথা শুনে রাখিস আমার বস চাঁদের পাহাড় এর সাথে লাগতে আসিস না 🥵"})} , 115000);




  
  }
